In [1]:
import os
import pandas as pd
os.chdir(r"C:\Users\Gilseung\Google 드라이브\작업\온라인 강의 머신러닝 성능 향상을 위한 데이터 탐색과 전처리 심화\데이터\실습 데이터 - #1")

#### merge 기초

In [2]:
# Tip. OSError: Initializing from file failed가 발생하면 engine = "python"을 설정하면 피할 수 있음 (단, 속도 저하 문제가 있음)
df1 = pd.read_csv("merge_실습_employee&group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_employee&hire_date.csv", engine = "python")

In [3]:
df1.head()

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [4]:
df2.head()

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [5]:
merged_df = pd.merge(df1, df2) # 컬럼명이 같아서 키를 employee로 인식함
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### on을 사용하는 경우

In [6]:
merged_df = pd.merge(df1, df2, on = ["employee"])
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### left_on, right_on을 사용한 데이터 통합

In [7]:
df1 = pd.read_csv("merge_실습_employee&group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name&hire_date.csv", engine = "python")

In [8]:
df1.head()

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [9]:
df2.head()

   hire_date  name
0       2004  Lisa
1       2008   Bob
2       2012  Jake
3       2014   Sue

In [10]:
# 컬럼명을 바꿔도 똑같이 작동함
merged_df = pd.merge(df1, df2, left_on = "employee", right_on = "name")
merged_df.head() # employee와 name 모두 살아 있어서, 하나를 제거해줘야 함

  employee        group  hire_date  name
0      Bob   Accounting       2008   Bob
1     Jake  Engineering       2012  Jake
2     Lisa  Engineering       2004  Lisa
3      Sue           HR       2014   Sue

In [11]:
merged_df.drop('name', axis = 1, inplace = True)
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### index를 사용한 데이터 통합

In [12]:
df1 = pd.read_csv("merge_실습_employee&group.csv", engine = "python")
df2 = pd.read_csv("merge_실습_name&hire_date.csv", engine = "python", index_col = "name")

In [13]:
df2.head()

      hire_date
name
Lisa       2004
Bob        2008
Jake       2012
Sue        2014

In [14]:
merged_df = pd.merge(df1, df2, left_on = "employee", right_index = True)

In [15]:
merged_df.head()

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014